## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/f122b5981f68ca81dc2b877fb6d524395724f816" -> (known after apply)
!       name               = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/f122b5981f68ca81dc2b877fb6d524395724f816" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJZGt1NW84UXR2Q3N3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJNall6TXpNM01qTXdNREEyTXprM05Ea3dNQ0FYRFRJeU1Ea3hPVEF6TURJek1Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWXlOak16TXpjeU16QXdNRFl6T1RjME9UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ1RNTitJTHdZeEltZUlJd2lVTkljMmxLQnoKYWhVQ0xEcjNYbWxkaWZIY1FOODZkUTk0bHdJdmt1dUI5UWowMi95MmxiUWJWeFNOcG1rR1VoemVmc3hpOU9kbgpjNm02Zm1heGVZYTNSVFB5bHVHOUZFbHQvNkg0anB1Q2o5T2VlU083QXgrdmxpQWxQTFQzMFgrNUZYQWlTdnkyCndpVURMUzlkZGpCSGZHbW1oaWFEQmZVWFVoWm1CK2JSOW9DNTZ4QWFxZjZOQ2hJZ21MVk02OFFSd0dINFpkMm8Kc0c2dkczYS9yRW0vZGdxQlZoSXY2TkZ1ZE44MUZiemxOMzVTSm1PQWxGOEh1Vi9mVFBvbDA3YmxNUmtXMzlKQwp1ODRzc2tFRkVOZVRSeWNTUlI5ajZFR2FLK2JxanllNUdac1Q3ZEMremJCU1BqSDFWeFZ2eHpPVzZPcnRBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQjBmUnFra2daUnJHQmdqWVMrbk9sUQpHbW8zRE1LMmN4WlhMZm9nTFgrcHNCc3RlMXA4eXJBblNxS0VWc3JkSzR3dFRKUzIxSStpNmt2RlBROC9hVTJDCnNwVEpla0NKZFJ4MGtUOVNuS01DYTRxV2tuYmVLWGNHaGVqYnM5N0w5LzhUNUtUT0VqNXJ0U0p5QzMyM3FjdU4KNDlIbnB2T2ErWW5xQTZiV3BnOE55TEdpemZQNXlSQXhkcGY0VmlRREhjU1pLWi91SmJLT3R5Vk9vcVJRU2FTawoyWU9sZWlZL0o0WjlnSHJyY1RySXU5UGtXRUs5SVRRUHI2WTVUZUVTdDdSTkF2MWREVjB0NklYWlVIUmg2Wk5mClFxaCtjUHh1QUUvU2RVeUsrSkVVYWJmUEVCamtIUmlTRnNKQ2N0WmVoMElVb29GZC9Rdm9JUlB5U0JPcmJJMmkKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-19T03:02:30Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-cinema"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/terrateam-cinema/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       initial_node_count          = 2 -> 1
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-d64b9aac-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-5db22699-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-d64b9aac-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroups/gke-cinema-core-5db22699-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 2 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.3-gke.2100" -> (known after apply)
        # (4 unchanged attributes hidden)

!       autoscaling {
!           max_node_count       = 8 -> 2
!           min_node_count       = 2 -> 1
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

!       node_config {
!           machine_type      = "n2d-standard-2" -> "n2-highcpu-4" # forces replacement
+           min_cpu_platform  = (known after apply)
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (11 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "3935693396711318631" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "7665723347453770065" -> (known after apply)
!       triggers = {
-           "arguments"             = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "create_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "993117981297185308" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 6 to add, 2 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
